{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "T5ForConditionalGeneration",
    "parent_library": "transformers.models.t5.modeling_t5"
  },
  "base_model_name_or_path": "google/flan-t5-base",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q",
    "k",
    "o",
    "v"
  ],
  "task_type": null
}